In [2]:
import pandas as pd
import requests
from io import StringIO
import numpy as np

In [3]:
res = requests.get('https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/refs/heads/main/day33-handling-mixed-variables/titanic.csv').text
df = pd.read_csv(StringIO(res))

In [4]:
df['numerical_val'] = pd.to_numeric(df['number'], errors='coerce', downcast='integer')
df['categorical_val'] = np.where(df['numerical_val'].isnull(), df['number'], np.nan)

In [5]:
df.head()

  Cabin            Ticket number  Survived  numerical_val categorical_val
0   NaN         A/5 21171      5         0            5.0             NaN
1   C85          PC 17599      3         1            3.0             NaN
2   NaN  STON/O2. 3101282      6         1            6.0             NaN
3  C123            113803      3         1            3.0             NaN
4   NaN            373450      A         0            NaN               A

In [8]:
df['Cabin_num'] = df['Cabin'].str.extract(r'(\d+)')
df['Cabin_cat'] = df['Cabin'].str[0]

In [9]:
df.head()

,Cabin,Ticket,number,Survived,numerical_val,categorical_val,Cabin_num,Cabin_cat,cabin_num,cabin_cat
0,NaN,A/5 21171,5,0,5.0,NaN,NaN,NaN,NaN,NaN
1,C85,PC 17599,3,1,3.0,NaN,85,C,85,C
2,NaN,STON/O2. 3101282,6,1,6.0,NaN,NaN,NaN,NaN,NaN
3,C123,113803,3,1,3.0,NaN,123,C,123,C
4,NaN,373450,A,0,NaN,A,NaN,NaN,NaN,NaN

In [16]:
df['ticket_num'] = df['Ticket'].apply(lambda s: s.split()[-1])
df['ticket_num'] = pd.to_numeric(df['ticket_num'], errors='coerce', downcast='integer')

df['ticket_cat'] = df['Ticket'].apply(lambda s: s.split()[0])
df['ticket_cat'] = np.where(df['ticket_cat'].str.isdigit(), np.nan, df['ticket_cat'])

df.head()

,Cabin,Ticket,number,Survived,numerical_val,categorical_val,Cabin_num,Cabin_cat,cabin_num,cabin_cat,ticket_num,ticket_cat
0,NaN,A/5 21171,5,0,5.0,NaN,NaN,NaN,NaN,NaN,21171.0,A/5
1,C85,PC 17599,3,1,3.0,NaN,85,C,85,C,17599.0,PC
2,NaN,STON/O2. 3101282,6,1,6.0,NaN,NaN,NaN,NaN,NaN,3101282.0,STON/O2.
3,C123,113803,3,1,3.0,NaN,123,C,123,C,113803.0,NaN
4,NaN,373450,A,0,NaN,A,NaN,NaN,NaN,NaN,373450.0,NaN